# SQL Lab

In this lab we will learn how to use execute SQL from the ipython notebook and practice some queries on the [Northwind sample database](https://northwinddatabase.codeplex.com/) that we used in Lesson 3.1.

You can access the data with this command:

    psql -h dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com -p 5432 -U dsi_student northwind
    password: gastudents

First of all let's install the ipython-sql extension. You can find instructions [here](https://github.com/catherinedevlin/ipython-sql).

_Instructor note:  This extension is inconsistent.  There was a point it was stable, but use the %sql extension at your own risk.. (There is really not risk other than it doetsn't work correctly)._

In [ ]:
# !pip install ipython-sql

Let's see if it works:

In [1]:
%load_ext sql

In [2]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
select * from orders limit 5;

5 rows affected.

[(10248, u'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, u'Vins et alcools Chevalier', u"59 rue de l'Abbaye", u'Reims', None, u'51100', u'France'),
 (10249, u'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, u'Toms Spezialit\xe4ten', u'Luisenstr. 48', u'M\xfcnster', None, u'44087', u'Germany'),
 (10250, u'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, u'Hanari Carnes', u'Rua do Pa\xe7o, 67', u'Rio de Janeiro', u'RJ', u'05454-876', u'Brazil'),
 (10251, u'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, u'Victuailles en stock', u'2, rue du Commerce', u'Lyon', None, u'69004', u'France'),
 (10252, u'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, u'Supr\xeames d\xe9lices', u'Boulevard Tirou, 255', u'Charleroi', None, u'B-6000', u'Belgium')]

Nice!!! We can now go ahead with the lab!

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:

from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind')


pd.read_sql("SELECT tablename FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

               tablename
0             categories
1      full_order_table5
2                     fo
3             table_join
4             full_order
5   customercustomerdemo
6   customerdemographics
7              customers
8              employees
9    employeeterritories
10         order_details
11                orders
12              products
13                region
14              shippers
15          shippers_tmp
16             suppliers
17           territories
18              usstates
19                table1
20                movies
21               ratings
22      categoriesmerged
23           order_table
24              full_ord
25             new_table
26      full_order_table
27     full_order_table2
28     full_order_table3
29     full_order_table4
30            temp_table
31          full_orders_
32           fullorders_
33          fullorders__
34            fullorders
35          descriptions
36                 price
37         descriptions1
38              empterid
39            google_app
40                 final
41                final2
42                final3
43                final4
44   credit_card_feature
45                price2
46         descriptions2
47             empterid2
48                final5
49              my_table
50             newregion
51          updatdregion
52         updatedregion
53        updatedregion1

## 1: Inspect the database

If we were connected via console, it would be easy to list all tables using `\dt`. We can however access table information performing a query on the `information_schema.tables` table.

### 1.a: List Tables

1. write a `SELECT` statement that lists all the tables in the public schema of the `northwind` database, sorted alphabetically

In [7]:
sql = '''
SELECT "tablename"
FROM pg_catalog.pg_tables
ORDER BY "tablename" ASC

'''

pd.read_sql(sql, con=engine)

                   tablename
0                 categories
1           categoriesmerged
2        credit_card_feature
3       customercustomerdemo
4       customerdemographics
5                  customers
6               descriptions
7              descriptions1
8              descriptions2
9                  employees
10       employeeterritories
11                  empterid
12                 empterid2
13                     final
14                    final2
15                    final3
16                    final4
17                    final5
18                        fo
19                  full_ord
20                full_order
21          full_order_table
22         full_order_table2
23         full_order_table3
24         full_order_table4
25         full_order_table5
26              full_orders_
27                fullorders
28               fullorders_
29              fullorders__
..                       ...
82              pg_ts_config
83          pg_ts_config_map
84                pg_ts_dict
85              pg_ts_parser
86            pg_ts_template
87                   pg_type
88           pg_user_mapping
89                     price
90                    price2
91                  products
92                   ratings
93                    region
94                  shippers
95              shippers_tmp
96              sql_features
97   sql_implementation_info
98             sql_languages
99              sql_packages
100                sql_parts
101               sql_sizing
102      sql_sizing_profiles
103                suppliers
104                   table1
105               table_join
106               temp_table
107              territories
108             updatdregion
109            updatedregion
110           updatedregion1
111                 usstates

[112 rows x 1 columns]

### 1.b: Print Schemas

The table `INFORMATION_SCHEMA.COLUMNS` contains schema information on each.

Query it to display schemas of all the public tables. In particular we are interested in the column names and data types. Make sure you only include public schemas to avoid cluttering your results with a bunch of postgres related stuff.

In [13]:
sql = '''
SELECT "table_name", "data_type", "table_schema"
FROM INFORMATION_SCHEMA.COLUMNS
WHERE "table_schema" = 'public'
'''

pd.read_sql(sql, con=engine)

               table_name          data_type table_schema
0              categories           smallint       public
1              categories  character varying       public
2              categories               text       public
3              categories              bytea       public
4       full_order_table5           smallint       public
5       full_order_table5               real       public
6       full_order_table5           smallint       public
7       full_order_table5           smallint       public
8       full_order_table5          character       public
9       full_order_table5          character       public
10                     fo           smallint       public
11                     fo               real       public
12                     fo           smallint       public
13                     fo           smallint       public
14                     fo          character       public
15                     fo          character       public
16             table_join           smallint       public
17             table_join          character       public
18             table_join          character       public
19             table_join           smallint       public
20             table_join           smallint       public
21             table_join               real       public
22             full_order           smallint       public
23             full_order          character       public
24             full_order          character       public
25             full_order           smallint       public
26             full_order           smallint       public
27             full_order               real       public
28             full_order           smallint       public
29   customercustomerdemo          character       public
..                    ...                ...          ...
281                price2               real       public
282         descriptions2          character       public
283         descriptions2          character       public
284         descriptions2  character varying       public
285             empterid2           smallint       public
286             empterid2  character varying       public
287                final5           smallint       public
288                final5          character       public
289                final5          character       public
290                final5           smallint       public
291                final5           smallint       public
292                final5               real       public
293              my_table          character       public
294              my_table           smallint       public
295              my_table           smallint       public
296              my_table           smallint       public
297              my_table           smallint       public
298              my_table               real       public
299              my_table          character       public
300             newregion            integer       public
301             newregion  character varying       public
302          updatdregion            integer       public
303          updatdregion  character varying       public
304         updatedregion            integer       public
305         updatedregion  character varying       public
306        updatedregion1            integer       public
307        updatedregion1  character varying       public
308          ship_secrets  character varying       public
309          ship_secrets  character varying       public
310          ship_secrets  character varying       public

[311 rows x 3 columns]

### 1.c: Table peek

Another way of quickly looking at table information is to query the first few rows. Do this for a couple of tables, for example: `orders`, `products`, `usstates`. Display only the first 3 rows.

In [19]:
sql = '''
SELECT *
FROM INFORMATION_SCHEMA.COLUMNS
WHERE "table_name" = 'orders'
LIMIT 3
'''

pd.read_sql(sql, con=engine)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,northwind,public,orders,OrderID,1,None,NO,smallint,None,NaN,...,NO,None,None,None,None,None,None,NEVER,None,YES
1,northwind,public,orders,CustomerID,2,None,YES,character,None,1.073742e+09,...,NO,None,None,None,None,None,None,NEVER,None,YES
2,northwind,public,orders,EmployeeID,3,None,YES,smallint,None,NaN,...,NO,None,None,None,None,None,None,NEVER,None,YES

As you can see, some tables (like `usstates` or `region`) contain information that is probably less prone to change than other tables (like `orders` or `order_details`). This database is well organized to avoid unnecessary duplication. Let's start digging deeper in the data.

## 2: Products

What products is this company selling? The `products` and `categories` tables contain information to answer this question.

Use a combination of SQL queries and Pandas merge to answer the following questions:

- What categories of products is the company selling?
- How many products per category does the catalog contain?
- Let's focus only on products that have not been discontinued => how many products per category?
- What are the most expensive 5 products (not discontinued)?
- How many units of each of these 5 products are there in stock?
- Draw a pie chart of the categories, with slices that have the size of the number of products in that category (use non discontinued products)

### 2.a: What categories of products is the company selling?

Remember that PostgreSQL is case sensitive.

In [29]:
sql = '''
SELECT DISTINCT "CategoryName"
FROM Categories;
'''

pd.read_sql(sql, con=engine)

     CategoryName
0       Beverages
1         Produce
2         Seafood
3  Grains/Cereals
4     Confections
5    Meat/Poultry
6      Condiments
7  Dairy Products

### 2.b: How many products per category does the catalog contain?

Keep in mind that you can cast a %sql result to a pandas dataframe using the `.DataFrame()` method.

In [33]:
sql = '''
SELECT * --DISTINCT "CategoryName"
FROM Categories;
'''

df = pd.read_sql(sql, con=engine)

df['Description'] = df['Description'].map(lambda x: len(x))

In [34]:
df

   CategoryID    CategoryName  Description Picture
0           1       Beverages           43      []
1           2      Condiments           58      []
2           3     Confections           35      []
3           4  Dairy Products            7      []
4           5  Grains/Cereals           35      []
5           6    Meat/Poultry           14      []
6           7         Produce           25      []
7           8         Seafood           16      []

### 2.c: How many not discontinued products per category?

In [39]:
sql = '''
SELECT COUNT("ProductID")
FROM products
WHERE "Discontinued" = 0
'''

pd.read_sql(sql, con=engine)

   count
0     67

### 2.d: What are the most expensive 5 products (not discontinued)?

In [43]:
sql = '''
SELECT "ProductName", "UnitPrice"
FROM products
ORDER BY "UnitPrice" DESC
LIMIT 5
'''

pd.read_sql(sql, con=engine)

               ProductName  UnitPrice
0            Côte de Blaye     263.50
1  Thüringer Rostbratwurst     123.79
2          Mishi Kobe Niku      97.00
3   Sir Rodney's Marmalade      81.00
4         Carnarvon Tigers      62.50

### 2.e: How many units of each of these 5 products are there in stock?

In [47]:
sql = '''
SELECT "ProductName", "UnitPrice", "UnitsInStock"
FROM products
ORDER BY "UnitPrice" DESC
--WHERE "UnitsInStock" > 0
LIMIT 5
'''

pd.read_sql(sql, con=engine)

               ProductName  UnitPrice  UnitsInStock
0            Côte de Blaye     263.50            17
1  Thüringer Rostbratwurst     123.79             0
2          Mishi Kobe Niku      97.00            29
3   Sir Rodney's Marmalade      81.00            40
4         Carnarvon Tigers      62.50            42

### 2.f: Pie Chart

Use pandas to make a pie chart plot.

In [ ]:
#STUPID

## 3: Orders

Now that we have a better understanding of products, let's start digging into orders.

- How many orders in total?
- How many orders per year
- How many orders per quarter
- Which country is receiving the most orders
- Which country is receiving the least
- What's the average shipping time (ShippedDate - OrderDate)
- What customer is submitting the highest number of orders?
- What customer is generating the highest revenue (need to pd.merge with order_details)
- What fraction of the revenue is generated by the top 5 customers?

### 3.a: How many orders in total?

In [54]:
sql = '''
SELECT COUNT("OrderID")
FROM orders;
'''

pd.read_sql(sql, con=engine)

   count
0    830

### 3.b: How many orders per year?

In [132]:
sql = '''

SELECT EXTRACT(YEAR FROM "OrderDate") AS "Year", COUNT(*) 
FROM orders
GROUP BY EXTRACT(YEAR FROM "OrderDate")
'''

pd.read_sql(sql, con=engine)

     Year  count
0  1997.0    408
1  1998.0    270
2  1996.0    152

### 3.c: How many orders per quarter?

Make a line plot for these.

### 3.d: Which country is receiving the most orders?

In [131]:
sql = '''

SELECT * --"ShipCountry", "OrderID",
FROM Orders
--ORDER BY "ShipCountry" DESC;
--GROUP BY "ShipCountry";

'''

pd.read_sql(sql, con=engine)

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium
5,10253,HANAR,3,1996-07-10,1996-07-24,1996-07-16,2,58.17,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
6,10254,CHOPS,5,1996-07-11,1996-08-08,1996-07-23,2,22.98,Chop-suey Chinese,Hauptstr. 31,Bern,None,3012,Switzerland
7,10255,RICSU,9,1996-07-12,1996-08-09,1996-07-15,3,148.33,Richter Supermarkt,Starenweg 5,Genève,None,1204,Switzerland
8,10256,WELLI,3,1996-07-15,1996-08-12,1996-07-17,2,13.97,Wellington Importadora,"Rua do Mercado, 12",Resende,SP,08737-363,Brazil
9,10257,HILAA,4,1996-07-16,1996-08-13,1996-07-22,3,81.91,HILARION-Abastos,Carrera 22 con Ave. Carlos Soublette #8-35,San Cristóbal,Táchira,5022,Venezuela
10,10258,ERNSH,1,1996-07-17,1996-08-14,1996-07-23,1,140.51,Ernst Handel,Kirchgasse 6,Graz,None,8010,Austria
11,10259,CENTC,4,1996-07-18,1996-08-15,1996-07-25,3,3.25,Centro comercial Moctezuma,Sierras de Granada 9993,México D.F.,None,05022,Mexico
12,10260,OTTIK,4,1996-07-19,1996-08-16,1996-07-29,1,55.09,Ottilies Käseladen,Mehrheimerstr. 369,Köln,None,50739,Germany
13,10261,QUEDE,4,1996-07-19,1996-08-16,1996-07-30,2,3.05,Que Delícia,"Rua da Panificadora, 12",Rio de Janeiro,RJ,02389-673,Brazil
14,10262,RATTC,8,1996-07-22,1996-08-19,1996-07-25,3,48.29,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA
15,10263,ERNSH,9,1996-07-23,1996-08-20,1996-07-31,3,146.06,Ernst Handel,Kirchgasse 6,Graz,None,8010,Austria
16,10264,FOLKO,6,1996-07-24,1996-08-21,1996-08-23,3,3.67,Folk och fä HB,Åkergatan 24,Bräcke,None,S-844 67,Sweden
17,10265,BLONP,2,1996-07-25,1996-08-22,1996-08-12,1,55.28,Blondel père et fils,"24, place Kléber",Strasbourg,None,67000,France
18,10266,WARTH,3,1996-07-26,1996-09-06,1996-07-31,3,25.73,Wartian Herkku,Torikatu 38,Oulu,None,90110,Finland
19,10267,FRANK,4,1996-07-29,1996-08-26,1996-08-06,1,208.58,Frankenversand,Berliner Platz 43,München,None,80805,Germany
20,10268,GROSR,8,1996-07-30,1996-08-27,1996-08-02,3,66.29,GROSELLA-Restaurante,5ª Ave. Los Palos Grandes,Caracas,DF,1081,Venezuela
21,10269,WHITC,5,1996-07-31,1996-08-14,1996-08-09,1,4.56,White Clover Markets,1029 - 12th Ave. S.,Seattle,WA,98124,USA
22,10270,WARTH,1,1996-08-01,1996-08-29,1996-08-02,1,136.54,Wartian Herkku,Torikatu 38,Oulu,None,90110,Finland
23,10271,SPLIR,6,1996-08-01,1996-08-29,1996-08-30,2,4.54,Split Rail Beer & Ale,P.O. Box 555,Lander,WY,82520,USA
24,10272,RATTC,6,1996-08-02,1996-08-30,1996-08-06,2,98.03,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA
25,10273,QUICK,3,1996-08-05,1996-09-02,1996-08-12,3,76.07,QUICK-Stop,Taucherstraße 10,Cunewalde,None,01307,Germany
26,10274,VINET,6,1996-08-06,1996-09-03,1996-08-16,1,6.01,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
27,10275,MAGAA,1,1996-08-07,1996-09-04,1996-08-09,1,26.93,Magazzini Alimentari Riuniti,Via Ludovico il Moro 22,Bergamo,None,24100,Italy
28,10276,TORTU,8,1996-08-08,1996-08-22,1996-08-14,3,13.84,Tortuga Restaurante,Avda. Azteca 123,México D.F.,None,05033,Mexico
29,10277,MORGK,2,1996-08-09,1996-09-06,1996-08-13,3,125.77,Morgenstern Gesundkost,Heerstr. 22,Leipzig,None,04179,Germany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
800,11048,BOTTM,7,1998-04-24,1998-05-22,1998-04-30,3,24.12,Bottom-Dollar Markets,23 Tsawassen Blvd.,Tsawassen,BC,T2F 8M4,Canada
801,11049,GOURL,3,1998-04-24,1998-05-22,1998-05-04,1,8.34,Gourmet Lanchonetes,"Av. Brasil, 442",Campinas,SP,04876-786,Brazil
802,11050,FOLKO,8,1998-04-27,1998-05-25,1998-05-05,2,59.41,Folk och fä HB,Åkergatan 24,Bräcke,None,S-844 67,Sweden
803,11051,LAMAI,7,1998-04-27,1998-05-25,None,3,2.79,La maison d'Asie,1 rue Alsace-Lorraine,Toulouse,None,31000,France
804,11052,HANAR,3,1998-04-27,1998-05-25,1998-05-01,1,67.26,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
805,11053,PICCO,2,1998-04-27,1998-05-25,1998-04-29,2,53.05,Piccolo und mehr,Geislweg 14,Salzburg,None,5020,Austria
806,11054,CACTU,8,1998-04-28,1998-05-26,None,1,0.33,Cactus Comidas para llevar,Cerrito 333,Buenos Aires,None,1010,Argentina
807,11055,HILAA,7,1998-04-28,1998-05-26,1998-05-05,2,120.92,HILARION-Abastos,Carrera 22 con Ave. Carlos Soublette #8-35,San Cristóbal,Táchira,5022,Venezuela
808,11056,EASTC,8,1998-04-28,1998-05-12,1998-05-01,2,278.96,Eastern Connection,35 King George,London,None,WX3 6FW,UK
809,11057,NORTS,3,1998-04-29,1998-05-27,1998-05-01,3,4.13,North/South,South House 300 Queensbridge,London,None,SW7 1RZ,UK
810,11058,BLAUS,9,1998-04-29,1998-05-27,None,3,31.14,Blauer See Delikatessen,Forsterstr. 57,Mannheim,None,68306,Germany
811,11059,RICAR,2,1998-04-29,1998-06-10,None,2,85.80,Ricardo Adocicados,"Av. Copacabana, 267",Rio de Janeiro,RJ,02389-890,Brazil
812,11060,FRANS,2,1998-04-30,1998-05-28,1998-05-04,2,10.98,Franchi S.p.A.,Via Monte Bianco 34,Torino,None,10100,Italy
813,11061,GREAL,4,1998-04-30,1998-06-11,None,3,14.01,Great Lakes Food Market,2732 Baker Blvd.,Eugene,OR,97403,USA
814,11062,REGGC,4,1998-04-30,1998-05-28,None,2,29.93,Reggiani Caseifici,Strada Provinciale 124,Reggio Emilia,None,42100,Italy
815,11063,HUNGO,3,1998-04-30,1998-05-28,1998-05-06,2,81.73,Hungry Owl All-Night Grocers,8 Johnstown Road,Cork,Co. Cork,None,Ireland
816,11064,SAVEA,1,1998-05-01,1998-05-29,1998-05-04,1,30.09,Save-a-lot Markets,187 Suffolk Ln.,Boise,ID,83720,USA
817,11065,LILAS,8,1998-05-01,1998-05-29,None,1,12.91,LILA-Supermercado,Carrera 52 con Ave. Bolívar #65-98 Llano Largo,Barquisimeto,Lara,3508,Venezuela
818,11066,WHITC,7,1998-05-01,1998-05-29,1998-05-04,2,44.72,White Clover Markets,1029 - 12th Ave. S.,Seattle,WA,98124,USA
819,11067,DRACD,1,1998-05-04,1998-05-18,1998-05-06,2,7.98,Drachenblut Delikatessen,Walserweg 21,Aachen,None,52066,Germany
820,11068,QUEEN,8,1998-05-04,1998-06-01,None,2,81.75,Queen Cozinha,"Alameda dos Canàrios, 891",Sao Paulo,SP,05487-020,Brazil
821,11069,TORTU,1,1998-05-04,1998-06-01,1998-05-06,2,15.67,Tortuga Restaurante,Avda. Azteca 123,México D.F.,None,05033,Mexico
822,11070,LEHMS,2,1998-05-05,1998-06-02,None,1,136.00,Lehmanns Marktstand,Magazinweg 7,Frankfurt a.M.,None,60528,Germany
823,11071,LILAS,1,1998-05-05,1998-06-02,None,1,0.93,LILA-Supermercado,Carrera 52 con Ave. Bolívar #65-98 Llano Largo,Barquisimeto,Lara,3508,Venezuela
824,11072,ERNSH,4,1998-05-05,1998-06-02,None,2,258.64,Ernst Handel,Kirchgasse 6,Graz,None,8010,Austria
825,11073,PERIC,2,1998-05-05,1998-06-02,None,2,24.95,Pericles Comidas clásicas,Calle Dr. Jorge Cash 321,México D.F.,None,05033,Mexico
826,11074,SIMOB,7,1998-05-06,1998-06-03,None,2,18.44,Simons bistro,Vinbæltet 34,Kobenhavn,None,1734,Denmark
827,11075,RICSU,8,1998-05-06,1998-06-03,None,2,6.19,Richter Supermarkt,Starenweg 5,Genève,None,1204,Switzerland
828,11076,BONAP,4,1998-05-06,1998-06-03,None,2,38.28,Bon app',"12, rue des Bouchers",Marseille,None,13008,France
829,11077,RATTC,1,1998-05-06,1998-06-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA

### 3.e: Which country is receiving the least?

### 3.f: What's the average shipping time (ShippedDate - OrderDate)?

### 3.g: What customer is submitting the highest number of orders?

### 3.h: What customer is generating the highest revenue (need to pd.merge with order_details)?

### 3.i: What fraction of the revenue is generated by the top 5 customers?

Compare that with the fraction represented by 5 customers over the total number of customers.

Wow!! 5.5% of the customers generate a third of the revenue!!

## Bonus: Other tables

Investigate the content of other tables. In particular lookt at the `suppliers`, `shippers` and `employees` tables.